app/views/articles/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%=f.label :tags %>
    <%= f.select :tags,Tag.all.map { |t| [t.title ,t.id] },multiple: true, required: true %>