app/controllers/articles_controller.rb

  def index
      @articles =   if params[:item]
        Article.find_by("#{params[:filter]}","#{params[:term]}")
      else
     Article.all
---
SELECT "articles".* FROM "articles"